app/Controllers/API/Clientes.php

INSERT INTO `cliente` (`nombre`, `apellido`, `telefono`, `correo`, `created_at`, `updated_at`) VALUES ('Jhon', 'Bohorquez', '1234567890', 'jhon@aya.com', '2022-05-12 17:30:16', '2022-05-12 17:30:16')
---
	public function crear(){

		try {
			$cliente = $this->request->getJSON();
			$date = explode("-", $cliente->{'created_at'});
			if ($date[0]>'1992' and $date[0]<'2005'){
				if ($this->model->insert($cliente)):