app/Controllers/Home.php

	public function log(){
        try {
			$token='';
            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

			if ($password== '' or $username== '') {
				$response = [
					'message' => 'credenciales vacias',
					'token' => 'credenciales vacias'
				];
				return $this->respond($response, 200);
            }


            $UserModel = new UsuarioModel();
            $where = ['username' => $username, 'password' => $password];
            $valUser = $UserModel->where($where)->find();
---
SELECT *
FROM `usuario`
WHERE `username` = 'jhon'
AND `password` = '123'